const errorMessages = {
    ERR001: '予期せぬ例外が発生しました。',
    INFO001: '検索結果が0件です。',
    MSG001: '{0}は入力必須です。',
    MSG002: '{0}はセットで入力必須です。',
    MSG003: '{0}は{1} 形式で入力してください。',
    MSG004: '{0}は{1}以上{2} 以下の範囲で入力してください。',
    MSG005: '{0}は{1}以内で入力してください。',
    MSG006: '前画面からのパラメータは全必須項目です。',
    MSG007: '全項目入力・選択必須です。',
    MSG008: '{0}は{1} よりも後の日程を設定してください。',
    MSG009: '{0}と{1}の間隔は{2} になるように設定してください。',
    MSG010: '{0}と入力された年月と合致しません。',
    MSG011: '{0}は有効な年月を入力してください。',
};

export default errorMessages;